In [1]:
import numpy as np
import pandas as pd

In [3]:
from numpy import nan as NA

In [5]:
df= pd.DataFrame([[1,2,3],[4,None,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [100]:
df.isnull().any() #column ma hercha

0    True
1    True
2    True
dtype: bool

In [45]:
df.dropna(inplace=False)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [47]:
df.dropna(how="all") #jun ma purai nan cha tyo matra hatcha

     0   1   2
0  1.0 NaN NaN
1  4.0 NaN NaN

In [86]:
df= pd.DataFrame([[1,2,3],[4,None,5],[NA,NA,NA]])
df[1]=NA
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [59]:
df.dropna(axis=1,how="all")

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [61]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [63]:
df.fillna(0)

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [88]:
df.fillna({0:15,1:25,2:35},inplace=False)

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [90]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [94]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [110]:
df.fillna(method="ffill",limit=1)

C:\Users\DELL\AppData\Local\Temp\ipykernel_11268\1059200199.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=1)

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  4.0 NaN  5.0

In [104]:
df.fillna(df.mean(axis=1))

     0    1    2
0  1.0  4.5  3.0
1  4.0  4.5  5.0
2  2.0  4.5  NaN